Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
extern volatile __SS1Rbits_t SS1Rbits __asm__ ("SS1R") __attribute__((section("sfrs"), address(0xBF80149C)));
#define SDI2R SDI2R
extern volatile uint32_t   SDI2R __attribute__((section("sfrs"), address(0xBF8014A4)));
typedef struct {
  uint32_t SDI2R:4;
} __SDI2Rbits_t;
extern volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R") __attribute__((section("sfrs"), address(0xBF8014A4)));
#define SS2R SS2R
extern volatile uint32_t   SS2R __attribute__((section("sfrs"), address(0xBF8014A8)));
typedef struct {
  uint32_t SS2R:4;
} __SS2Rbits_t;
extern volatile __SS2Rbits_t SS2Rbits __asm__ ("SS2R") __attribute__((section("sfrs"), address(0xBF8014A8)));
#define SCK3R SCK3R
extern volatile uint32_t   SCK3R __attribute__((section("sfrs"), address(0xBF8014AC)));
typedef struct {
  uint32_t SCK3R:4;
} __SCK3Rbits_t;
extern volatile __SCK3Rbits_t SCK3Rbits __asm__ ("SCK3R") __attribute__((section("sfrs"), address(0xBF8014AC)));
#define SDI3R SDI3R
extern volatile uint32_t   SDI3R __attribute__((section("sfrs"), address(0xBF8014B0)));
typedef struct {
  uint32_t SDI3R:4;
} __SDI3Rbits_t;
extern volatile __SDI3Rbits_t SDI3Rbits __asm__ ("SDI3R") __attribute__((section("sfrs"), address(0xBF8014B0)));
#define SS3R SS3R
extern volatile uint32_t   SS3R __attribute__((section("sfrs"), address(0xBF8014B4)));
typedef struct {
  uint32_t SS3R:4;
} __SS3Rbits_t;
extern volatile __SS3Rbits_t SS3Rbits __asm__ ("SS3R") __attribute__((section("sfrs"), address(0xBF8014B4)));
#define SCK4R SCK4R
extern volatile uint32_t   SCK4R __attribute__((section("sfrs"), address(0xBF8014B8)));
typedef struct {
  uint32_t SCK4R:4;
} __SCK4Rbits_t;
extern volatile __SCK4Rbits_t SCK4Rbits __asm__ ("SCK4R") __attribute__((section("sfrs"), address(0xBF8014B8)));
#define SDI4R SDI4R
extern volatile uint32_t   SDI4R __attribute__((section("sfrs"), address(0xBF8014BC)));
typedef struct {
  uint32_t SDI4R:4;
} __SDI4Rbits_t;
extern volatile __SDI4Rbits_t SDI4Rbits __asm__ ("SDI4R") __attribute__((section("sfrs"), address(0xBF8014BC)));
#define SS4R SS4R
extern volatile uint32_t   SS4R __attribute__((section("sfrs"), address(0xBF8014C0)));
typedef struct {
  uint32_t SS4R:4;
} __SS4Rbits_t;
extern volatile __SS4Rbits_t SS4Rbits __asm__ ("SS4R") __attribute__((section("sfrs"), address(0xBF8014C0)));
#define C1RXR C1RXR
extern volatile uint32_t   C1RXR __attribute__((section("sfrs"), address(0xBF8014C4)));
typedef struct {
  uint32_t C1RXR:4;
} __C1RXRbits_t;
extern volatile __C1RXRbits_t C1RXRbits __asm__ ("C1RXR") __attribute__((section("sfrs"), address(0xBF8014C4)));
#define C2RXR C2RXR
extern volatile uint32_t   C2RXR __attribute__((section("sfrs"), address(0xBF8014C8)));
typedef struct {
  uint32_t C2RXR:4;
} __C2RXRbits_t;
extern volatile __C2RXRbits_t C2RXRbits __asm__ ("C2RXR") __attribute__((section("sfrs"), address(0xBF8014C8)));
#define REFIR REFIR
extern volatile uint32_t   REFIR __attribute__((section("sfrs"), address(0xBF8014CC)));
typedef struct {
  uint32_t REFIR:4;
} __REFIRbits_t;
extern volatile __REFIRbits_t REFIRbits __asm__ ("REFIR") __attribute__((section("sfrs"), address(0xBF8014CC)));
#define IC10R IC10R
extern volatile uint32_t   IC10R __attribute__((section("sfrs"), address(0xBF8014F8)));
typedef struct {
  uint32_t IC10R:4;
} __IC10Rbits_t;
extern volatile __IC10Rbits_t IC10Rbits __asm__ ("IC10R") __attribute__((section("sfrs"), address(0xBF8014F8)));
#define IC11R IC11R
extern volatile uint32_t   IC11R __attribute__((section("sfrs"), address(0xBF8014FC)));
typedef struct {
  uint32_t IC11R:4;
} __IC11Rbits_t;
extern volatile __IC11Rbits_t IC11Rbits __asm__ ("IC11R") __attribute__((section("sfrs"), address(0xBF8014FC)));
#define IC12R IC12R
extern volatile uint32_t   IC12R __attribute__((section("sfrs"), address(0xBF801500)));
typedef struct {
  uint32_t IC12R:4;
} __IC12Rbits_t;
extern volatile __IC12Rbits_t IC12Rbits __asm__ ("IC12R") __attribute__((section("sfrs"), address(0xBF801500)));
#define IC13R IC13R
extern volatile uint32_t   IC13R __attribute__((section("sfrs"), address(0xBF801504)));
typedef struct {
  uint32_t IC13R:4;
} __IC13Rbits_t;
extern volatile __IC13Rbits_t IC13Rbits __asm__ ("IC13R") __attribute__((section("sfrs"), address(0xBF801504)));
#define IC14R IC14R
extern volatile uint32_t   IC14R __attribute__((section("sfrs"), address(0xBF801508)));
typedef struct {
  uint32_t IC14R:4;
} __IC14Rbits_t;
extern volatile __IC14Rbits_t IC14Rbits __asm__ ("IC14R") __attribute__((section("sfrs"), address(0xBF801508)));
#define IC15R IC15R
extern volatile uint32_t   IC15R __attribute__((section("sfrs"), address(0xBF80150C)));
typedef struct {
  uint32_t IC15R:4;
} __IC15Rbits_t;
extern volatile __IC15Rbits_t IC15Rbits __asm__ ("IC15R") __attribute__((section("sfrs"), address(0xBF80150C)));
#define IC16R IC16R
extern volatile uint32_t   IC16R __attribute__((section("sfrs"), address(0xBF801510)));
typedef struct {
  uint32_t IC16R:4;
} __IC16Rbits_t;
extern volatile __IC16Rbits_t IC16Rbits __asm__ ("IC16R") __attribute__((section("sfrs"), address(0xBF801510)));
#define SCK5R SCK5R
extern volatile uint32_t   SCK5R __attribute__((section("sfrs"), address(0xBF801514)));
typedef struct {
  uint32_t SCK5R:4;
} __SCK5Rbits_t;
extern volatile __SCK5Rbits_t SCK5Rbits __asm__ ("SCK5R") __attribute__((section("sfrs"), address(0xBF801514)));
#define SDI5R SDI5R
extern volatile uint32_t   SDI5R __attribute__((section("sfrs"), address(0xBF801518)));
typedef struct {
  uint32_t SDI5R:4;
} __SDI5Rbits_t;
extern volatile __SDI5Rbits_t SDI5Rbits __asm__ ("SDI5R") __attribute__((section("sfrs"), address(0xBF801518)));
#define SS5R SS5R
extern volatile uint32_t   SS5R __attribute__((section("sfrs"), address(0xBF80151C)));
typedef struct {
  uint32_t SS5R:4;
} __SS5Rbits_t;
extern volatile __SS5Rbits_t SS5Rbits __asm__ ("SS5R") __attribute__((section("sfrs"), address(0xBF80151C)));
#define SCK6R SCK6R
extern volatile uint32_t   SCK6R __attribute__((section("sfrs"), address(0xBF801520)));
typedef struct {
  uint32_t SCK6R:4;
} __SCK6Rbits_t;
extern volatile __SCK6Rbits_t SCK6Rbits __asm__ ("SCK6R") __attribute__((section("sfrs"), address(0xBF801520)));
#define SDI6R SDI6R
extern volatile uint32_t   SDI6R __attribute__((section("sfrs"), address(0xBF801524)));
typedef struct {
  uint32_t SDI6R:4;
} __SDI6Rbits_t;
