Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
extern volatile __OC15CONbits_t OC15CONbits __asm__ ("OC15CON") __attribute__((section("sfrs"), address(0xBF845C00)));
extern volatile uint32_t        OC15CONCLR __attribute__((section("sfrs"),address(0xBF845C04)));
extern volatile uint32_t        OC15CONSET __attribute__((section("sfrs"),address(0xBF845C08)));
extern volatile uint32_t        OC15CONINV __attribute__((section("sfrs"),address(0xBF845C0C)));
#define OC15R OC15R
extern volatile uint32_t   OC15R __attribute__((section("sfrs"), address(0xBF845C10)));
extern volatile uint32_t        OC15RCLR __attribute__((section("sfrs"),address(0xBF845C14)));
extern volatile uint32_t        OC15RSET __attribute__((section("sfrs"),address(0xBF845C18)));
extern volatile uint32_t        OC15RINV __attribute__((section("sfrs"),address(0xBF845C1C)));
#define OC15RS OC15RS
extern volatile uint32_t   OC15RS __attribute__((section("sfrs"), address(0xBF845C20)));
extern volatile uint32_t        OC15RSCLR __attribute__((section("sfrs"),address(0xBF845C24)));
extern volatile uint32_t        OC15RSSET __attribute__((section("sfrs"),address(0xBF845C28)));
extern volatile uint32_t        OC15RSINV __attribute__((section("sfrs"),address(0xBF845C2C)));
#define OC16CON OC16CON
extern volatile uint32_t   OC16CON __attribute__((section("sfrs"), address(0xBF845E00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC16CONbits_t;
extern volatile __OC16CONbits_t OC16CONbits __asm__ ("OC16CON") __attribute__((section("sfrs"), address(0xBF845E00)));
extern volatile uint32_t        OC16CONCLR __attribute__((section("sfrs"),address(0xBF845E04)));
extern volatile uint32_t        OC16CONSET __attribute__((section("sfrs"),address(0xBF845E08)));
extern volatile uint32_t        OC16CONINV __attribute__((section("sfrs"),address(0xBF845E0C)));
#define OC16R OC16R
extern volatile uint32_t   OC16R __attribute__((section("sfrs"), address(0xBF845E10)));
extern volatile uint32_t        OC16RCLR __attribute__((section("sfrs"),address(0xBF845E14)));
extern volatile uint32_t        OC16RSET __attribute__((section("sfrs"),address(0xBF845E18)));
extern volatile uint32_t        OC16RINV __attribute__((section("sfrs"),address(0xBF845E1C)));
#define OC16RS OC16RS
extern volatile uint32_t   OC16RS __attribute__((section("sfrs"), address(0xBF845E20)));
extern volatile uint32_t        OC16RSCLR __attribute__((section("sfrs"),address(0xBF845E24)));
extern volatile uint32_t        OC16RSSET __attribute__((section("sfrs"),address(0xBF845E28)));
extern volatile uint32_t        OC16RSINV __attribute__((section("sfrs"),address(0xBF845E2C)));
#define I2C3CON I2C3CON
extern volatile uint32_t   I2C3CON __attribute__((section("sfrs"), address(0xBF846400)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C3CONbits_t;
extern volatile __I2C3CONbits_t I2C3CONbits __asm__ ("I2C3CON") __attribute__((section("sfrs"), address(0xBF846400)));
extern volatile uint32_t        I2C3CONCLR __attribute__((section("sfrs"),address(0xBF846404)));
extern volatile uint32_t        I2C3CONSET __attribute__((section("sfrs"),address(0xBF846408)));
extern volatile uint32_t        I2C3CONINV __attribute__((section("sfrs"),address(0xBF84640C)));
#define I2C3STAT I2C3STAT
extern volatile uint32_t   I2C3STAT __attribute__((section("sfrs"), address(0xBF846410)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C3STATbits_t;
extern volatile __I2C3STATbits_t I2C3STATbits __asm__ ("I2C3STAT") __attribute__((section("sfrs"), address(0xBF846410)));
extern volatile uint32_t        I2C3STATCLR __attribute__((section("sfrs"),address(0xBF846414)));
extern volatile uint32_t        I2C3STATSET __attribute__((section("sfrs"),address(0xBF846418)));
extern volatile uint32_t        I2C3STATINV __attribute__((section("sfrs"),address(0xBF84641C)));
#define I2C3ADD I2C3ADD
extern volatile uint32_t   I2C3ADD __attribute__((section("sfrs"), address(0xBF846420)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C3ADDbits_t;
extern volatile __I2C3ADDbits_t I2C3ADDbits __asm__ ("I2C3ADD") __attribute__((section("sfrs"), address(0xBF846420)));
extern volatile uint32_t        I2C3ADDCLR __attribute__((section("sfrs"),address(0xBF846424)));
extern volatile uint32_t        I2C3ADDSET __attribute__((section("sfrs"),address(0xBF846428)));
extern volatile uint32_t        I2C3ADDINV __attribute__((section("sfrs"),address(0xBF84642C)));
#define I2C3MSK I2C3MSK
extern volatile uint32_t   I2C3MSK __attribute__((section("sfrs"), address(0xBF846430)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C3MSKbits_t;
extern volatile __I2C3MSKbits_t I2C3MSKbits __asm__ ("I2C3MSK") __attribute__((section("sfrs"), address(0xBF846430)));
extern volatile uint32_t        I2C3MSKCLR __attribute__((section("sfrs"),address(0xBF846434)));
extern volatile uint32_t        I2C3MSKSET __attribute__((section("sfrs"),address(0xBF846438)));
extern volatile uint32_t        I2C3MSKINV __attribute__((section("sfrs"),address(0xBF84643C)));
#define I2C3BRG I2C3BRG
extern volatile uint32_t   I2C3BRG __attribute__((section("sfrs"), address(0xBF846440)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C3BRGbits_t;
