Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
extern volatile __C2RXF11bits_t C2RXF11bits __asm__ ("C2RXF11") __attribute__((section("sfrs"), address(0xBF8811F0)));
extern volatile uint32_t        C2RXF11CLR __attribute__((section("sfrs"),address(0xBF8811F4)));
extern volatile uint32_t        C2RXF11SET __attribute__((section("sfrs"),address(0xBF8811F8)));
extern volatile uint32_t        C2RXF11INV __attribute__((section("sfrs"),address(0xBF8811FC)));
#define C2RXF12 C2RXF12
extern volatile uint32_t   C2RXF12 __attribute__((section("sfrs"), address(0xBF881200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF12bits_t;
extern volatile __C2RXF12bits_t C2RXF12bits __asm__ ("C2RXF12") __attribute__((section("sfrs"), address(0xBF881200)));
extern volatile uint32_t        C2RXF12CLR __attribute__((section("sfrs"),address(0xBF881204)));
extern volatile uint32_t        C2RXF12SET __attribute__((section("sfrs"),address(0xBF881208)));
extern volatile uint32_t        C2RXF12INV __attribute__((section("sfrs"),address(0xBF88120C)));
#define C2RXF13 C2RXF13
extern volatile uint32_t   C2RXF13 __attribute__((section("sfrs"), address(0xBF881210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF13bits_t;
extern volatile __C2RXF13bits_t C2RXF13bits __asm__ ("C2RXF13") __attribute__((section("sfrs"), address(0xBF881210)));
extern volatile uint32_t        C2RXF13CLR __attribute__((section("sfrs"),address(0xBF881214)));
extern volatile uint32_t        C2RXF13SET __attribute__((section("sfrs"),address(0xBF881218)));
extern volatile uint32_t        C2RXF13INV __attribute__((section("sfrs"),address(0xBF88121C)));
#define C2RXF14 C2RXF14
extern volatile uint32_t   C2RXF14 __attribute__((section("sfrs"), address(0xBF881220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF14bits_t;
extern volatile __C2RXF14bits_t C2RXF14bits __asm__ ("C2RXF14") __attribute__((section("sfrs"), address(0xBF881220)));
extern volatile uint32_t        C2RXF14CLR __attribute__((section("sfrs"),address(0xBF881224)));
extern volatile uint32_t        C2RXF14SET __attribute__((section("sfrs"),address(0xBF881228)));
extern volatile uint32_t        C2RXF14INV __attribute__((section("sfrs"),address(0xBF88122C)));
#define C2RXF15 C2RXF15
extern volatile uint32_t   C2RXF15 __attribute__((section("sfrs"), address(0xBF881230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF15bits_t;
extern volatile __C2RXF15bits_t C2RXF15bits __asm__ ("C2RXF15") __attribute__((section("sfrs"), address(0xBF881230)));
extern volatile uint32_t        C2RXF15CLR __attribute__((section("sfrs"),address(0xBF881234)));
extern volatile uint32_t        C2RXF15SET __attribute__((section("sfrs"),address(0xBF881238)));
extern volatile uint32_t        C2RXF15INV __attribute__((section("sfrs"),address(0xBF88123C)));
#define C2FIFOBA C2FIFOBA
extern volatile uint32_t   C2FIFOBA __attribute__((section("sfrs"), address(0xBF881340)));
extern volatile uint32_t        C2FIFOBACLR __attribute__((section("sfrs"),address(0xBF881344)));
extern volatile uint32_t        C2FIFOBASET __attribute__((section("sfrs"),address(0xBF881348)));
extern volatile uint32_t        C2FIFOBAINV __attribute__((section("sfrs"),address(0xBF88134C)));
#define C2FIFOCON0 C2FIFOCON0
extern volatile uint32_t   C2FIFOCON0 __attribute__((section("sfrs"), address(0xBF881350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON0bits_t;
extern volatile __C2FIFOCON0bits_t C2FIFOCON0bits __asm__ ("C2FIFOCON0") __attribute__((section("sfrs"), address(0xBF881350)));
extern volatile uint32_t        C2FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF881354)));
extern volatile uint32_t        C2FIFOCON0SET __attribute__((section("sfrs"),address(0xBF881358)));
extern volatile uint32_t        C2FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88135C)));
#define C2FIFOINT0 C2FIFOINT0
extern volatile uint32_t   C2FIFOINT0 __attribute__((section("sfrs"), address(0xBF881360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT0bits_t;
extern volatile __C2FIFOINT0bits_t C2FIFOINT0bits __asm__ ("C2FIFOINT0") __attribute__((section("sfrs"), address(0xBF881360)));
extern volatile uint32_t        C2FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF881364)));
extern volatile uint32_t        C2FIFOINT0SET __attribute__((section("sfrs"),address(0xBF881368)));
extern volatile uint32_t        C2FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88136C)));
#define C2FIFOUA0 C2FIFOUA0
extern volatile uint32_t   C2FIFOUA0 __attribute__((section("sfrs"), address(0xBF881370)));
extern volatile uint32_t        C2FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF881374)));
extern volatile uint32_t        C2FIFOUA0SET __attribute__((section("sfrs"),address(0xBF881378)));
extern volatile uint32_t        C2FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88137C)));
#define C2FIFOCI0 C2FIFOCI0
extern volatile uint32_t   C2FIFOCI0 __attribute__((section("sfrs"), address(0xBF881380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI0bits_t;
extern volatile __C2FIFOCI0bits_t C2FIFOCI0bits __asm__ ("C2FIFOCI0") __attribute__((section("sfrs"), address(0xBF881380)));
extern volatile uint32_t        C2FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF881384)));
extern volatile uint32_t        C2FIFOCI0SET __attribute__((section("sfrs"),address(0xBF881388)));
extern volatile uint32_t        C2FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88138C)));
#define C2FIFOCON1 C2FIFOCON1
extern volatile uint32_t   C2FIFOCON1 __attribute__((section("sfrs"), address(0xBF881390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON1bits_t;
extern volatile __C2FIFOCON1bits_t C2FIFOCON1bits __asm__ ("C2FIFOCON1") __attribute__((section("sfrs"), address(0xBF881390)));
extern volatile uint32_t        C2FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF881394)));
extern volatile uint32_t        C2FIFOCON1SET __attribute__((section("sfrs"),address(0xBF881398)));
extern volatile uint32_t        C2FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88139C)));
#define C2FIFOINT1 C2FIFOINT1
extern volatile uint32_t   C2FIFOINT1 __attribute__((section("sfrs"), address(0xBF8813A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT1bits_t;
