Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
extern volatile __SBT1RD5bits_t SBT1RD5bits __asm__ ("SBT1RD5") __attribute__((section("sfrs"), address(0xBF8F84F0)));
#define SBT1WR5 SBT1WR5
extern volatile uint32_t   SBT1WR5 __attribute__((section("sfrs"), address(0xBF8F84F8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR5bits_t;
extern volatile __SBT1WR5bits_t SBT1WR5bits __asm__ ("SBT1WR5") __attribute__((section("sfrs"), address(0xBF8F84F8)));
#define SBT1REG6 SBT1REG6
extern volatile uint32_t   SBT1REG6 __attribute__((section("sfrs"), address(0xBF8F8500)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG6bits_t;
extern volatile __SBT1REG6bits_t SBT1REG6bits __asm__ ("SBT1REG6") __attribute__((section("sfrs"), address(0xBF8F8500)));
#define SBT1RD6 SBT1RD6
extern volatile uint32_t   SBT1RD6 __attribute__((section("sfrs"), address(0xBF8F8510)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD6bits_t;
extern volatile __SBT1RD6bits_t SBT1RD6bits __asm__ ("SBT1RD6") __attribute__((section("sfrs"), address(0xBF8F8510)));
#define SBT1WR6 SBT1WR6
extern volatile uint32_t   SBT1WR6 __attribute__((section("sfrs"), address(0xBF8F8518)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR6bits_t;
extern volatile __SBT1WR6bits_t SBT1WR6bits __asm__ ("SBT1WR6") __attribute__((section("sfrs"), address(0xBF8F8518)));
#define SBT1REG7 SBT1REG7
extern volatile uint32_t   SBT1REG7 __attribute__((section("sfrs"), address(0xBF8F8520)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG7bits_t;
extern volatile __SBT1REG7bits_t SBT1REG7bits __asm__ ("SBT1REG7") __attribute__((section("sfrs"), address(0xBF8F8520)));
#define SBT1RD7 SBT1RD7
extern volatile uint32_t   SBT1RD7 __attribute__((section("sfrs"), address(0xBF8F8530)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD7bits_t;
extern volatile __SBT1RD7bits_t SBT1RD7bits __asm__ ("SBT1RD7") __attribute__((section("sfrs"), address(0xBF8F8530)));
#define SBT1WR7 SBT1WR7
extern volatile uint32_t   SBT1WR7 __attribute__((section("sfrs"), address(0xBF8F8538)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR7bits_t;
extern volatile __SBT1WR7bits_t SBT1WR7bits __asm__ ("SBT1WR7") __attribute__((section("sfrs"), address(0xBF8F8538)));
#define SBT1REG8 SBT1REG8
extern volatile uint32_t   SBT1REG8 __attribute__((section("sfrs"), address(0xBF8F8540)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG8bits_t;
extern volatile __SBT1REG8bits_t SBT1REG8bits __asm__ ("SBT1REG8") __attribute__((section("sfrs"), address(0xBF8F8540)));
#define SBT1RD8 SBT1RD8
extern volatile uint32_t   SBT1RD8 __attribute__((section("sfrs"), address(0xBF8F8550)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD8bits_t;
extern volatile __SBT1RD8bits_t SBT1RD8bits __asm__ ("SBT1RD8") __attribute__((section("sfrs"), address(0xBF8F8550)));
#define SBT1WR8 SBT1WR8
extern volatile uint32_t   SBT1WR8 __attribute__((section("sfrs"), address(0xBF8F8558)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR8bits_t;
extern volatile __SBT1WR8bits_t SBT1WR8bits __asm__ ("SBT1WR8") __attribute__((section("sfrs"), address(0xBF8F8558)));
#define SBT2ELOG1 SBT2ELOG1
extern volatile uint32_t   SBT2ELOG1 __attribute__((section("sfrs"), address(0xBF8F8820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT2ELOG1bits_t;
extern volatile __SBT2ELOG1bits_t SBT2ELOG1bits __asm__ ("SBT2ELOG1") __attribute__((section("sfrs"), address(0xBF8F8820)));
#define SBT2ELOG2 SBT2ELOG2
extern volatile uint32_t   SBT2ELOG2 __attribute__((section("sfrs"), address(0xBF8F8824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT2ELOG2bits_t;
extern volatile __SBT2ELOG2bits_t SBT2ELOG2bits __asm__ ("SBT2ELOG2") __attribute__((section("sfrs"), address(0xBF8F8824)));
#define SBT2ECON SBT2ECON
extern volatile uint32_t   SBT2ECON __attribute__((section("sfrs"), address(0xBF8F8828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT2ECONbits_t;
extern volatile __SBT2ECONbits_t SBT2ECONbits __asm__ ("SBT2ECON") __attribute__((section("sfrs"), address(0xBF8F8828)));
#define SBT2ECLRS SBT2ECLRS
extern volatile uint32_t   SBT2ECLRS __attribute__((section("sfrs"), address(0xBF8F8830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT2ECLRSbits_t;
extern volatile __SBT2ECLRSbits_t SBT2ECLRSbits __asm__ ("SBT2ECLRS") __attribute__((section("sfrs"), address(0xBF8F8830)));
#define SBT2ECLRM SBT2ECLRM
extern volatile uint32_t   SBT2ECLRM __attribute__((section("sfrs"), address(0xBF8F8838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT2ECLRMbits_t;
extern volatile __SBT2ECLRMbits_t SBT2ECLRMbits __asm__ ("SBT2ECLRM") __attribute__((section("sfrs"), address(0xBF8F8838)));
#define SBT2REG0 SBT2REG0
extern volatile uint32_t   SBT2REG0 __attribute__((section("sfrs"), address(0xBF8F8840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT2REG0bits_t;
extern volatile __SBT2REG0bits_t SBT2REG0bits __asm__ ("SBT2REG0") __attribute__((section("sfrs"), address(0xBF8F8840)));
#define SBT2RD0 SBT2RD0
extern volatile uint32_t   SBT2RD0 __attribute__((section("sfrs"), address(0xBF8F8850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2RD0bits_t;
extern volatile __SBT2RD0bits_t SBT2RD0bits __asm__ ("SBT2RD0") __attribute__((section("sfrs"), address(0xBF8F8850)));
#define SBT2WR0 SBT2WR0
extern volatile uint32_t   SBT2WR0 __attribute__((section("sfrs"), address(0xBF8F8858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2WR0bits_t;
