Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_DAC1MD_POSITION                    0x00000004
#define _PMD1_DAC1MD_MASK                        0x00000010
#define _PMD1_DAC1MD_LENGTH                      0x00000001

#define _PMD1_DAC2MD_POSITION                    0x00000005
#define _PMD1_DAC2MD_MASK                        0x00000020
#define _PMD1_DAC2MD_LENGTH                      0x00000001

#define _PMD1_DAC3MD_POSITION                    0x00000006
#define _PMD1_DAC3MD_MASK                        0x00000040
#define _PMD1_DAC3MD_LENGTH                      0x00000001

#define _PMD1_CTMUMD_POSITION                    0x00000008
#define _PMD1_CTMUMD_MASK                        0x00000100
#define _PMD1_CTMUMD_LENGTH                      0x00000001

#define _PMD1_EEMD_POSITION                      0x00000009
#define _PMD1_EEMD_MASK                          0x00000200
#define _PMD1_EEMD_LENGTH                        0x00000001

#define _PMD1_HLVDMD_POSITION                    0x00000014
#define _PMD1_HLVDMD_MASK                        0x00100000
#define _PMD1_HLVDMD_LENGTH                      0x00000001

#define _PMD2_CMP1MD_POSITION                    0x00000000
#define _PMD2_CMP1MD_MASK                        0x00000001
#define _PMD2_CMP1MD_LENGTH                      0x00000001

#define _PMD2_CMP2MD_POSITION                    0x00000001
#define _PMD2_CMP2MD_MASK                        0x00000002
#define _PMD2_CMP2MD_LENGTH                      0x00000001

#define _PMD2_CMP3MD_POSITION                    0x00000002
#define _PMD2_CMP3MD_MASK                        0x00000004
#define _PMD2_CMP3MD_LENGTH                      0x00000001

#define _PMD2_CMP4MD_POSITION                    0x00000003
#define _PMD2_CMP4MD_MASK                        0x00000008
#define _PMD2_CMP4MD_LENGTH                      0x00000001

#define _PMD2_CMP5MD_POSITION                    0x00000004
#define _PMD2_CMP5MD_MASK                        0x00000010
#define _PMD2_CMP5MD_LENGTH                      0x00000001

#define _PMD2_OPA1MD_POSITION                    0x00000010
#define _PMD2_OPA1MD_MASK                        0x00010000
#define _PMD2_OPA1MD_LENGTH                      0x00000001

#define _PMD2_OPA2MD_POSITION                    0x00000011
#define _PMD2_OPA2MD_MASK                        0x00020000
#define _PMD2_OPA2MD_LENGTH                      0x00000001

#define _PMD2_OPA3MD_POSITION                    0x00000012
#define _PMD2_OPA3MD_MASK                        0x00040000
#define _PMD2_OPA3MD_LENGTH                      0x00000001

#define _PMD2_OPA5MD_POSITION                    0x00000014
#define _PMD2_OPA5MD_MASK                        0x00100000
#define _PMD2_OPA5MD_LENGTH                      0x00000001

#define _PMD3_IC1MD_POSITION                     0x00000000
#define _PMD3_IC1MD_MASK                         0x00000001
#define _PMD3_IC1MD_LENGTH                       0x00000001

#define _PMD3_IC2MD_POSITION                     0x00000001
#define _PMD3_IC2MD_MASK                         0x00000002
#define _PMD3_IC2MD_LENGTH                       0x00000001

#define _PMD3_IC3MD_POSITION                     0x00000002
#define _PMD3_IC3MD_MASK                         0x00000004
#define _PMD3_IC3MD_LENGTH                       0x00000001

#define _PMD3_IC4MD_POSITION                     0x00000003
#define _PMD3_IC4MD_MASK                         0x00000008
#define _PMD3_IC4MD_LENGTH                       0x00000001

#define _PMD3_IC5MD_POSITION                     0x00000004
#define _PMD3_IC5MD_MASK                         0x00000010
#define _PMD3_IC5MD_LENGTH                       0x00000001

#define _PMD3_IC6MD_POSITION                     0x00000005
#define _PMD3_IC6MD_MASK                         0x00000020
#define _PMD3_IC6MD_LENGTH                       0x00000001

#define _PMD3_IC7MD_POSITION                     0x00000006
#define _PMD3_IC7MD_MASK                         0x00000040
#define _PMD3_IC7MD_LENGTH                       0x00000001

#define _PMD3_IC8MD_POSITION                     0x00000007
#define _PMD3_IC8MD_MASK                         0x00000080
#define _PMD3_IC8MD_LENGTH                       0x00000001

#define _PMD3_IC9MD_POSITION                     0x00000008
#define _PMD3_IC9MD_MASK                         0x00000100
#define _PMD3_IC9MD_LENGTH                       0x00000001

#define _PMD3_IC10MD_POSITION                    0x00000009
#define _PMD3_IC10MD_MASK                        0x00000200
#define _PMD3_IC10MD_LENGTH                      0x00000001

#define _PMD3_IC11MD_POSITION                    0x0000000A
#define _PMD3_IC11MD_MASK                        0x00000400
#define _PMD3_IC11MD_LENGTH                      0x00000001

#define _PMD3_IC12MD_POSITION                    0x0000000B
#define _PMD3_IC12MD_MASK                        0x00000800
#define _PMD3_IC12MD_LENGTH                      0x00000001

#define _PMD3_IC13MD_POSITION                    0x0000000C
#define _PMD3_IC13MD_MASK                        0x00001000
#define _PMD3_IC13MD_LENGTH                      0x00000001

#define _PMD3_IC14MD_POSITION                    0x0000000D
#define _PMD3_IC14MD_MASK                        0x00002000
#define _PMD3_IC14MD_LENGTH                      0x00000001

#define _PMD3_IC15MD_POSITION                    0x0000000E
#define _PMD3_IC15MD_MASK                        0x00004000
#define _PMD3_IC15MD_LENGTH                      0x00000001

#define _PMD3_IC16MD_POSITION                    0x0000000F
#define _PMD3_IC16MD_MASK                        0x00008000
#define _PMD3_IC16MD_LENGTH                      0x00000001

#define _PMD3_OC1MD_POSITION                     0x00000010
#define _PMD3_OC1MD_MASK                         0x00010000
#define _PMD3_OC1MD_LENGTH                       0x00000001

#define _PMD3_OC2MD_POSITION                     0x00000011
#define _PMD3_OC2MD_MASK                         0x00020000
#define _PMD3_OC2MD_LENGTH                       0x00000001

