Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _IFS5_I2C3MIF_POSITION                   0x00000015
#define _IFS5_I2C3MIF_MASK                       0x00200000
#define _IFS5_I2C3MIF_LENGTH                     0x00000001

#define _IFS5_DMA4IF_POSITION                    0x00000016
#define _IFS5_DMA4IF_MASK                        0x00400000
#define _IFS5_DMA4IF_LENGTH                      0x00000001

#define _IFS5_DMA5IF_POSITION                    0x00000017
#define _IFS5_DMA5IF_MASK                        0x00800000
#define _IFS5_DMA5IF_LENGTH                      0x00000001

#define _IFS5_DMA6IF_POSITION                    0x00000018
#define _IFS5_DMA6IF_MASK                        0x01000000
#define _IFS5_DMA6IF_LENGTH                      0x00000001

#define _IFS5_DMA7IF_POSITION                    0x00000019
#define _IFS5_DMA7IF_MASK                        0x02000000
#define _IFS5_DMA7IF_LENGTH                      0x00000001

#define _IFS5_DATAEEIF_POSITION                  0x0000001A
#define _IFS5_DATAEEIF_MASK                      0x04000000
#define _IFS5_DATAEEIF_LENGTH                    0x00000001

#define _IFS5_CAN3IF_POSITION                    0x0000001B
#define _IFS5_CAN3IF_MASK                        0x08000000
#define _IFS5_CAN3IF_LENGTH                      0x00000001

#define _IFS5_CAN4IF_POSITION                    0x0000001C
#define _IFS5_CAN4IF_MASK                        0x10000000
#define _IFS5_CAN4IF_LENGTH                      0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IFS6_I2C4BIF_POSITION                   0x00000002
#define _IFS6_I2C4BIF_MASK                       0x00000004
#define _IFS6_I2C4BIF_LENGTH                     0x00000001

#define _IFS6_I2C4SIF_POSITION                   0x00000003
#define _IFS6_I2C4SIF_MASK                       0x00000008
#define _IFS6_I2C4SIF_LENGTH                     0x00000001

#define _IFS6_I2C4MIF_POSITION                   0x00000004
#define _IFS6_I2C4MIF_MASK                       0x00000010
#define _IFS6_I2C4MIF_LENGTH                     0x00000001

#define _IFS6_IC10EIF_POSITION                   0x00000005
#define _IFS6_IC10EIF_MASK                       0x00000020
#define _IFS6_IC10EIF_LENGTH                     0x00000001

#define _IFS6_IC10IF_POSITION                    0x00000006
#define _IFS6_IC10IF_MASK                        0x00000040
#define _IFS6_IC10IF_LENGTH                      0x00000001

#define _IFS6_OC10IF_POSITION                    0x00000007
#define _IFS6_OC10IF_MASK                        0x00000080
#define _IFS6_OC10IF_LENGTH                      0x00000001

#define _IFS6_IC11EIF_POSITION                   0x00000008
#define _IFS6_IC11EIF_MASK                       0x00000100
#define _IFS6_IC11EIF_LENGTH                     0x00000001

#define _IFS6_IC11IF_POSITION                    0x00000009
#define _IFS6_IC11IF_MASK                        0x00000200
#define _IFS6_IC11IF_LENGTH                      0x00000001

#define _IFS6_OC11IF_POSITION                    0x0000000A
#define _IFS6_OC11IF_MASK                        0x00000400
#define _IFS6_OC11IF_LENGTH                      0x00000001

#define _IFS6_IC12EIF_POSITION                   0x0000000B
#define _IFS6_IC12EIF_MASK                       0x00000800
#define _IFS6_IC12EIF_LENGTH                     0x00000001

#define _IFS6_IC12IF_POSITION                    0x0000000C
#define _IFS6_IC12IF_MASK                        0x00001000
#define _IFS6_IC12IF_LENGTH                      0x00000001

#define _IFS6_OC12IF_POSITION                    0x0000000D
#define _IFS6_OC12IF_MASK                        0x00002000
#define _IFS6_OC12IF_LENGTH                      0x00000001

#define _IFS6_IC13EIF_POSITION                   0x0000000E
#define _IFS6_IC13EIF_MASK                       0x00004000
#define _IFS6_IC13EIF_LENGTH                     0x00000001

#define _IFS6_IC13IF_POSITION                    0x0000000F
#define _IFS6_IC13IF_MASK                        0x00008000
#define _IFS6_IC13IF_LENGTH                      0x00000001

#define _IFS6_OC13IF_POSITION                    0x00000010
#define _IFS6_OC13IF_MASK                        0x00010000
#define _IFS6_OC13IF_LENGTH                      0x00000001

#define _IFS6_IC14EIF_POSITION                   0x00000011
#define _IFS6_IC14EIF_MASK                       0x00020000
#define _IFS6_IC14EIF_LENGTH                     0x00000001

#define _IFS6_IC14IF_POSITION                    0x00000012
#define _IFS6_IC14IF_MASK                        0x00040000
#define _IFS6_IC14IF_LENGTH                      0x00000001

#define _IFS6_OC14IF_POSITION                    0x00000013
#define _IFS6_OC14IF_MASK                        0x00080000
#define _IFS6_OC14IF_LENGTH                      0x00000001

#define _IFS6_IC15EIF_POSITION                   0x00000014
#define _IFS6_IC15EIF_MASK                       0x00100000
#define _IFS6_IC15EIF_LENGTH                     0x00000001

#define _IFS6_IC15IF_POSITION                    0x00000015
#define _IFS6_IC15IF_MASK                        0x00200000
#define _IFS6_IC15IF_LENGTH                      0x00000001

#define _IFS6_OC15IF_POSITION                    0x00000016
#define _IFS6_OC15IF_MASK                        0x00400000
#define _IFS6_OC15IF_LENGTH                      0x00000001

#define _IFS6_IC16EIF_POSITION                   0x00000017
#define _IFS6_IC16EIF_MASK                       0x00800000
#define _IFS6_IC16EIF_LENGTH                     0x00000001

#define _IFS6_IC16IF_POSITION                    0x00000018
#define _IFS6_IC16IF_MASK                        0x01000000
#define _IFS6_IC16IF_LENGTH                      0x00000001

#define _IFS6_OC16IF_POSITION                    0x00000019
#define _IFS6_OC16IF_MASK                        0x02000000
#define _IFS6_OC16IF_LENGTH                      0x00000001

#define _IFS6_SPI3EIF_POSITION                   0x0000001A
#define _IFS6_SPI3EIF_MASK                       0x04000000
#define _IFS6_SPI3EIF_LENGTH                     0x00000001

#define _IFS6_SPI3RXIF_POSITION                  0x0000001B
#define _IFS6_SPI3RXIF_MASK                      0x08000000
#define _IFS6_SPI3RXIF_LENGTH                    0x00000001

#define _IFS6_SPI3TXIF_POSITION                  0x0000001C
#define _IFS6_SPI3TXIF_MASK                      0x10000000
#define _IFS6_SPI3TXIF_LENGTH                    0x00000001

#define _IFS6_SPI4EIF_POSITION                   0x0000001D
#define _IFS6_SPI4EIF_MASK                       0x20000000
#define _IFS6_SPI4EIF_LENGTH                     0x00000001

#define _IFS6_SPI4RXIF_POSITION                  0x0000001E
#define _IFS6_SPI4RXIF_MASK                      0x40000000
#define _IFS6_SPI4RXIF_LENGTH                    0x00000001

#define _IFS6_SPI4TXIF_POSITION                  0x0000001F
#define _IFS6_SPI4TXIF_MASK                      0x80000000
#define _IFS6_SPI4TXIF_LENGTH                    0x00000001

#define _IFS6_w_POSITION                         0x00000000
#define _IFS6_w_MASK                             0xFFFFFFFF
#define _IFS6_w_LENGTH                           0x00000020

#define _IFS7_SPI5EIF_POSITION                   0x00000000
#define _IFS7_SPI5EIF_MASK                       0x00000001
#define _IFS7_SPI5EIF_LENGTH                     0x00000001

#define _IFS7_SPI5RXIF_POSITION                  0x00000001
#define _IFS7_SPI5RXIF_MASK                      0x00000002
#define _IFS7_SPI5RXIF_LENGTH                    0x00000001

#define _IFS7_SPI5TXIF_POSITION                  0x00000002
#define _IFS7_SPI5TXIF_MASK                      0x00000004
#define _IFS7_SPI5TXIF_LENGTH                    0x00000001

#define _IFS7_SPI6EIF_POSITION                   0x00000003
#define _IFS7_SPI6EIF_MASK                       0x00000008
#define _IFS7_SPI6EIF_LENGTH                     0x00000001

#define _IFS7_SPI6RXIF_POSITION                  0x00000004
#define _IFS7_SPI6RXIF_MASK                      0x00000010
#define _IFS7_SPI6RXIF_LENGTH                    0x00000001

#define _IFS7_SPI6TXIF_POSITION                  0x00000005
#define _IFS7_SPI6TXIF_MASK                      0x00000020
#define _IFS7_SPI6TXIF_LENGTH                    0x00000001

#define _IFS7_SBIF_POSITION                      0x00000006
#define _IFS7_SBIF_MASK                          0x00000040
#define _IFS7_SBIF_LENGTH                        0x00000001

