Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _IPC8_CMP1IP_POSITION                    0x00000002
#define _IPC8_CMP1IP_MASK                        0x0000001C
#define _IPC8_CMP1IP_LENGTH                      0x00000003

#define _IPC8_CMP2IS_POSITION                    0x00000008
#define _IPC8_CMP2IS_MASK                        0x00000300
#define _IPC8_CMP2IS_LENGTH                      0x00000002

#define _IPC8_CMP2IP_POSITION                    0x0000000A
#define _IPC8_CMP2IP_MASK                        0x00001C00
#define _IPC8_CMP2IP_LENGTH                      0x00000003

#define _IPC8_USB1IS_POSITION                    0x00000010
#define _IPC8_USB1IS_MASK                        0x00030000
#define _IPC8_USB1IS_LENGTH                      0x00000002

#define _IPC8_USB1IP_POSITION                    0x00000012
#define _IPC8_USB1IP_MASK                        0x001C0000
#define _IPC8_USB1IP_LENGTH                      0x00000003

#define _IPC8_SPI1EIS_POSITION                   0x00000018
#define _IPC8_SPI1EIS_MASK                       0x03000000
#define _IPC8_SPI1EIS_LENGTH                     0x00000002

#define _IPC8_SPI1EIP_POSITION                   0x0000001A
#define _IPC8_SPI1EIP_MASK                       0x1C000000
#define _IPC8_SPI1EIP_LENGTH                     0x00000003

#define _IPC8_w_POSITION                         0x00000000
#define _IPC8_w_MASK                             0xFFFFFFFF
#define _IPC8_w_LENGTH                           0x00000020

#define _IPC9_SPI1RXIS_POSITION                  0x00000000
#define _IPC9_SPI1RXIS_MASK                      0x00000003
#define _IPC9_SPI1RXIS_LENGTH                    0x00000002

#define _IPC9_SPI1RXIP_POSITION                  0x00000002
#define _IPC9_SPI1RXIP_MASK                      0x0000001C
#define _IPC9_SPI1RXIP_LENGTH                    0x00000003

#define _IPC9_SPI1TXIS_POSITION                  0x00000008
#define _IPC9_SPI1TXIS_MASK                      0x00000300
#define _IPC9_SPI1TXIS_LENGTH                    0x00000002

#define _IPC9_SPI1TXIP_POSITION                  0x0000000A
#define _IPC9_SPI1TXIP_MASK                      0x00001C00
#define _IPC9_SPI1TXIP_LENGTH                    0x00000003

#define _IPC9_U1EIS_POSITION                     0x00000010
#define _IPC9_U1EIS_MASK                         0x00030000
#define _IPC9_U1EIS_LENGTH                       0x00000002

#define _IPC9_U1EIP_POSITION                     0x00000012
#define _IPC9_U1EIP_MASK                         0x001C0000
#define _IPC9_U1EIP_LENGTH                       0x00000003

#define _IPC9_U1RXIS_POSITION                    0x00000018
#define _IPC9_U1RXIS_MASK                        0x03000000
#define _IPC9_U1RXIS_LENGTH                      0x00000002

#define _IPC9_U1RXIP_POSITION                    0x0000001A
#define _IPC9_U1RXIP_MASK                        0x1C000000
#define _IPC9_U1RXIP_LENGTH                      0x00000003

#define _IPC9_w_POSITION                         0x00000000
#define _IPC9_w_MASK                             0xFFFFFFFF
#define _IPC9_w_LENGTH                           0x00000020

#define _IPC10_U1TXIS_POSITION                   0x00000000
#define _IPC10_U1TXIS_MASK                       0x00000003
#define _IPC10_U1TXIS_LENGTH                     0x00000002

#define _IPC10_U1TXIP_POSITION                   0x00000002
#define _IPC10_U1TXIP_MASK                       0x0000001C
#define _IPC10_U1TXIP_LENGTH                     0x00000003

#define _IPC10_I2C1BIS_POSITION                  0x00000008
#define _IPC10_I2C1BIS_MASK                      0x00000300
#define _IPC10_I2C1BIS_LENGTH                    0x00000002

#define _IPC10_I2C1BIP_POSITION                  0x0000000A
#define _IPC10_I2C1BIP_MASK                      0x00001C00
#define _IPC10_I2C1BIP_LENGTH                    0x00000003

#define _IPC10_I2C1SIS_POSITION                  0x00000010
#define _IPC10_I2C1SIS_MASK                      0x00030000
#define _IPC10_I2C1SIS_LENGTH                    0x00000002

#define _IPC10_I2C1SIP_POSITION                  0x00000012
#define _IPC10_I2C1SIP_MASK                      0x001C0000
#define _IPC10_I2C1SIP_LENGTH                    0x00000003

#define _IPC10_I2C1MIS_POSITION                  0x00000018
#define _IPC10_I2C1MIS_MASK                      0x03000000
#define _IPC10_I2C1MIS_LENGTH                    0x00000002

#define _IPC10_I2C1MIP_POSITION                  0x0000001A
#define _IPC10_I2C1MIP_MASK                      0x1C000000
#define _IPC10_I2C1MIP_LENGTH                    0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_CNAIS_POSITION                    0x00000000
#define _IPC11_CNAIS_MASK                        0x00000003
#define _IPC11_CNAIS_LENGTH                      0x00000002

#define _IPC11_CNAIP_POSITION                    0x00000002
#define _IPC11_CNAIP_MASK                        0x0000001C
#define _IPC11_CNAIP_LENGTH                      0x00000003

#define _IPC11_CNBIS_POSITION                    0x00000008
#define _IPC11_CNBIS_MASK                        0x00000300
#define _IPC11_CNBIS_LENGTH                      0x00000002

#define _IPC11_CNBIP_POSITION                    0x0000000A
#define _IPC11_CNBIP_MASK                        0x00001C00
#define _IPC11_CNBIP_LENGTH                      0x00000003

#define _IPC11_CNCIS_POSITION                    0x00000010
#define _IPC11_CNCIS_MASK                        0x00030000
#define _IPC11_CNCIS_LENGTH                      0x00000002

#define _IPC11_CNCIP_POSITION                    0x00000012
#define _IPC11_CNCIP_MASK                        0x001C0000
#define _IPC11_CNCIP_LENGTH                      0x00000003

#define _IPC11_CNDIS_POSITION                    0x00000018
#define _IPC11_CNDIS_MASK                        0x03000000
#define _IPC11_CNDIS_LENGTH                      0x00000002

#define _IPC11_CNDIP_POSITION                    0x0000001A
#define _IPC11_CNDIP_MASK                        0x1C000000
#define _IPC11_CNDIP_LENGTH                      0x00000003

#define _IPC11_w_POSITION                        0x00000000
#define _IPC11_w_MASK                            0xFFFFFFFF
#define _IPC11_w_LENGTH                          0x00000020

#define _IPC12_CNEIS_POSITION                    0x00000000
#define _IPC12_CNEIS_MASK                        0x00000003
#define _IPC12_CNEIS_LENGTH                      0x00000002

#define _IPC12_CNEIP_POSITION                    0x00000002
#define _IPC12_CNEIP_MASK                        0x0000001C
#define _IPC12_CNEIP_LENGTH                      0x00000003

