Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _OFF216_VOFF_POSITION                    0x00000001
#define _OFF216_VOFF_MASK                        0x0003FFFE
#define _OFF216_VOFF_LENGTH                      0x00000011

#define _OFF217_VOFF_POSITION                    0x00000001
#define _OFF217_VOFF_MASK                        0x0003FFFE
#define _OFF217_VOFF_LENGTH                      0x00000011

#define _OFF218_VOFF_POSITION                    0x00000001
#define _OFF218_VOFF_MASK                        0x0003FFFE
#define _OFF218_VOFF_LENGTH                      0x00000011

#define _OFF219_VOFF_POSITION                    0x00000001
#define _OFF219_VOFF_MASK                        0x0003FFFE
#define _OFF219_VOFF_LENGTH                      0x00000011

#define _OFF220_VOFF_POSITION                    0x00000001
#define _OFF220_VOFF_MASK                        0x0003FFFE
#define _OFF220_VOFF_LENGTH                      0x00000011

#define _OFF221_VOFF_POSITION                    0x00000001
#define _OFF221_VOFF_MASK                        0x0003FFFE
#define _OFF221_VOFF_LENGTH                      0x00000011

#define _OFF222_VOFF_POSITION                    0x00000001
#define _OFF222_VOFF_MASK                        0x0003FFFE
#define _OFF222_VOFF_LENGTH                      0x00000011

#define _OFF223_VOFF_POSITION                    0x00000001
#define _OFF223_VOFF_MASK                        0x0003FFFE
#define _OFF223_VOFF_LENGTH                      0x00000011

#define _OFF224_VOFF_POSITION                    0x00000001
#define _OFF224_VOFF_MASK                        0x0003FFFE
#define _OFF224_VOFF_LENGTH                      0x00000011

#define _OFF225_VOFF_POSITION                    0x00000001
#define _OFF225_VOFF_MASK                        0x0003FFFE
#define _OFF225_VOFF_LENGTH                      0x00000011

#define _OFF226_VOFF_POSITION                    0x00000001
#define _OFF226_VOFF_MASK                        0x0003FFFE
#define _OFF226_VOFF_LENGTH                      0x00000011

#define _OFF227_VOFF_POSITION                    0x00000001
#define _OFF227_VOFF_MASK                        0x0003FFFE
#define _OFF227_VOFF_LENGTH                      0x00000011

#define _OFF228_VOFF_POSITION                    0x00000001
#define _OFF228_VOFF_MASK                        0x0003FFFE
#define _OFF228_VOFF_LENGTH                      0x00000011

#define _OFF229_VOFF_POSITION                    0x00000001
#define _OFF229_VOFF_MASK                        0x0003FFFE
#define _OFF229_VOFF_LENGTH                      0x00000011

#define _OFF230_VOFF_POSITION                    0x00000001
#define _OFF230_VOFF_MASK                        0x0003FFFE
#define _OFF230_VOFF_LENGTH                      0x00000011

#define _OFF244_VOFF_POSITION                    0x00000001
#define _OFF244_VOFF_MASK                        0x0003FFFE
#define _OFF244_VOFF_LENGTH                      0x00000011

#define _OFF245_VOFF_POSITION                    0x00000001
#define _OFF245_VOFF_MASK                        0x0003FFFE
#define _OFF245_VOFF_LENGTH                      0x00000011

#define _OFF246_VOFF_POSITION                    0x00000001
#define _OFF246_VOFF_MASK                        0x0003FFFE
#define _OFF246_VOFF_LENGTH                      0x00000011

#define _OFF254_VOFF_POSITION                    0x00000001
#define _OFF254_VOFF_MASK                        0x0003FFFE
#define _OFF254_VOFF_LENGTH                      0x00000011

#define _OFF255_VOFF_POSITION                    0x00000001
#define _OFF255_VOFF_MASK                        0x0003FFFE
#define _OFF255_VOFF_LENGTH                      0x00000011

#define _DMACON_DMABUSY_POSITION                 0x0000000B
#define _DMACON_DMABUSY_MASK                     0x00000800
#define _DMACON_DMABUSY_LENGTH                   0x00000001

#define _DMACON_SUSPEND_POSITION                 0x0000000C
#define _DMACON_SUSPEND_MASK                     0x00001000
#define _DMACON_SUSPEND_LENGTH                   0x00000001

#define _DMACON_ON_POSITION                      0x0000000F
#define _DMACON_ON_MASK                          0x00008000
#define _DMACON_ON_LENGTH                        0x00000001

#define _DMASTAT_DMACH_POSITION                  0x00000000
#define _DMASTAT_DMACH_MASK                      0x00000007
#define _DMASTAT_DMACH_LENGTH                    0x00000003

#define _DMASTAT_RDWR_POSITION                   0x0000001F
#define _DMASTAT_RDWR_MASK                       0x80000000
#define _DMASTAT_RDWR_LENGTH                     0x00000001

#define _DMAADDR_DMAADDR_POSITION                0x00000000
#define _DMAADDR_DMAADDR_MASK                    0xFFFFFFFF
#define _DMAADDR_DMAADDR_LENGTH                  0x00000020

#define _DCRCCON_CRCCH_POSITION                  0x00000000
#define _DCRCCON_CRCCH_MASK                      0x00000007
#define _DCRCCON_CRCCH_LENGTH                    0x00000003

#define _DCRCCON_CRCTYP_POSITION                 0x00000005
#define _DCRCCON_CRCTYP_MASK                     0x00000020
#define _DCRCCON_CRCTYP_LENGTH                   0x00000001

#define _DCRCCON_CRCAPP_POSITION                 0x00000006
#define _DCRCCON_CRCAPP_MASK                     0x00000040
#define _DCRCCON_CRCAPP_LENGTH                   0x00000001

#define _DCRCCON_CRCEN_POSITION                  0x00000007
#define _DCRCCON_CRCEN_MASK                      0x00000080
#define _DCRCCON_CRCEN_LENGTH                    0x00000001

#define _DCRCCON_PLEN_POSITION                   0x00000008
#define _DCRCCON_PLEN_MASK                       0x00001F00
#define _DCRCCON_PLEN_LENGTH                     0x00000005

#define _DCRCCON_BITO_POSITION                   0x00000018
#define _DCRCCON_BITO_MASK                       0x01000000
#define _DCRCCON_BITO_LENGTH                     0x00000001

#define _DCRCCON_WBO_POSITION                    0x0000001B
#define _DCRCCON_WBO_MASK                        0x08000000
#define _DCRCCON_WBO_LENGTH                      0x00000001

#define _DCRCCON_BYTO_POSITION                   0x0000001C
#define _DCRCCON_BYTO_MASK                       0x30000000
#define _DCRCCON_BYTO_LENGTH                     0x00000002

#define _DCRCDATA_DCRCDATA_POSITION              0x00000000
#define _DCRCDATA_DCRCDATA_MASK                  0xFFFFFFFF
#define _DCRCDATA_DCRCDATA_LENGTH                0x00000020

