Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _CNFB_CNFB9_POSITION                     0x00000009
#define _CNFB_CNFB9_MASK                         0x00000200
#define _CNFB_CNFB9_LENGTH                       0x00000001

#define _CNFB_CNFB10_POSITION                    0x0000000A
#define _CNFB_CNFB10_MASK                        0x00000400
#define _CNFB_CNFB10_LENGTH                      0x00000001

#define _CNFB_CNFB11_POSITION                    0x0000000B
#define _CNFB_CNFB11_MASK                        0x00000800
#define _CNFB_CNFB11_LENGTH                      0x00000001

#define _CNFB_CNFB12_POSITION                    0x0000000C
#define _CNFB_CNFB12_MASK                        0x00001000
#define _CNFB_CNFB12_LENGTH                      0x00000001

#define _CNFB_CNFB13_POSITION                    0x0000000D
#define _CNFB_CNFB13_MASK                        0x00002000
#define _CNFB_CNFB13_LENGTH                      0x00000001

#define _CNFB_CNFB14_POSITION                    0x0000000E
#define _CNFB_CNFB14_MASK                        0x00004000
#define _CNFB_CNFB14_LENGTH                      0x00000001

#define _CNFB_CNFB15_POSITION                    0x0000000F
#define _CNFB_CNFB15_MASK                        0x00008000
#define _CNFB_CNFB15_LENGTH                      0x00000001

#define _SRCON0B_SR0B4_POSITION                  0x00000004
#define _SRCON0B_SR0B4_MASK                      0x00000010
#define _SRCON0B_SR0B4_LENGTH                    0x00000001

#define _SRCON0B_SR0B6_POSITION                  0x00000006
#define _SRCON0B_SR0B6_MASK                      0x00000040
#define _SRCON0B_SR0B6_LENGTH                    0x00000001

#define _SRCON0B_SR0B7_POSITION                  0x00000007
#define _SRCON0B_SR0B7_MASK                      0x00000080
#define _SRCON0B_SR0B7_LENGTH                    0x00000001

#define _SRCON0B_SR0B10_POSITION                 0x0000000A
#define _SRCON0B_SR0B10_MASK                     0x00000400
#define _SRCON0B_SR0B10_LENGTH                   0x00000001

#define _SRCON0B_SR0B11_POSITION                 0x0000000B
#define _SRCON0B_SR0B11_MASK                     0x00000800
#define _SRCON0B_SR0B11_LENGTH                   0x00000001

#define _SRCON0B_SR0B12_POSITION                 0x0000000C
#define _SRCON0B_SR0B12_MASK                     0x00001000
#define _SRCON0B_SR0B12_LENGTH                   0x00000001

#define _SRCON0B_SR0B13_POSITION                 0x0000000D
#define _SRCON0B_SR0B13_MASK                     0x00002000
#define _SRCON0B_SR0B13_LENGTH                   0x00000001

#define _SRCON0B_SR0B14_POSITION                 0x0000000E
#define _SRCON0B_SR0B14_MASK                     0x00004000
#define _SRCON0B_SR0B14_LENGTH                   0x00000001

#define _SRCON0B_SR0B15_POSITION                 0x0000000F
#define _SRCON0B_SR0B15_MASK                     0x00008000
#define _SRCON0B_SR0B15_LENGTH                   0x00000001

#define _SRCON1B_SR1B4_POSITION                  0x00000004
#define _SRCON1B_SR1B4_MASK                      0x00000010
#define _SRCON1B_SR1B4_LENGTH                    0x00000001

#define _SRCON1B_SR1B6_POSITION                  0x00000006
#define _SRCON1B_SR1B6_MASK                      0x00000040
#define _SRCON1B_SR1B6_LENGTH                    0x00000001

#define _SRCON1B_SR1B7_POSITION                  0x00000007
#define _SRCON1B_SR1B7_MASK                      0x00000080
#define _SRCON1B_SR1B7_LENGTH                    0x00000001

#define _SRCON1B_SR1B10_POSITION                 0x0000000A
#define _SRCON1B_SR1B10_MASK                     0x00000400
#define _SRCON1B_SR1B10_LENGTH                   0x00000001

#define _SRCON1B_SR1B11_POSITION                 0x0000000B
#define _SRCON1B_SR1B11_MASK                     0x00000800
#define _SRCON1B_SR1B11_LENGTH                   0x00000001

#define _SRCON1B_SR1B12_POSITION                 0x0000000C
#define _SRCON1B_SR1B12_MASK                     0x00001000
#define _SRCON1B_SR1B12_LENGTH                   0x00000001

#define _SRCON1B_SR1B13_POSITION                 0x0000000D
#define _SRCON1B_SR1B13_MASK                     0x00002000
#define _SRCON1B_SR1B13_LENGTH                   0x00000001

#define _SRCON1B_SR1B14_POSITION                 0x0000000E
#define _SRCON1B_SR1B14_MASK                     0x00004000
#define _SRCON1B_SR1B14_LENGTH                   0x00000001

#define _SRCON1B_SR1B15_POSITION                 0x0000000F
#define _SRCON1B_SR1B15_MASK                     0x00008000
#define _SRCON1B_SR1B15_LENGTH                   0x00000001

#define _ANSELC_ANSC0_POSITION                   0x00000000
#define _ANSELC_ANSC0_MASK                       0x00000001
#define _ANSELC_ANSC0_LENGTH                     0x00000001

#define _ANSELC_ANSC1_POSITION                   0x00000001
#define _ANSELC_ANSC1_MASK                       0x00000002
#define _ANSELC_ANSC1_LENGTH                     0x00000001

#define _ANSELC_ANSC2_POSITION                   0x00000002
#define _ANSELC_ANSC2_MASK                       0x00000004
#define _ANSELC_ANSC2_LENGTH                     0x00000001

#define _ANSELC_ANSC10_POSITION                  0x0000000A
#define _ANSELC_ANSC10_MASK                      0x00000400
#define _ANSELC_ANSC10_LENGTH                    0x00000001

#define _ANSELC_ANSC11_POSITION                  0x0000000B
#define _ANSELC_ANSC11_MASK                      0x00000800
#define _ANSELC_ANSC11_LENGTH                    0x00000001

#define _ANSELC_ANSC12_POSITION                  0x0000000C
#define _ANSELC_ANSC12_MASK                      0x00001000
#define _ANSELC_ANSC12_LENGTH                    0x00000001

#define _ANSELC_w_POSITION                       0x00000000
#define _ANSELC_w_MASK                           0xFFFFFFFF
#define _ANSELC_w_LENGTH                         0x00000020

#define _TRISC_TRISC0_POSITION                   0x00000000
#define _TRISC_TRISC0_MASK                       0x00000001
#define _TRISC_TRISC0_LENGTH                     0x00000001

#define _TRISC_TRISC1_POSITION                   0x00000001
#define _TRISC_TRISC1_MASK                       0x00000002
#define _TRISC_TRISC1_LENGTH                     0x00000001

#define _TRISC_TRISC2_POSITION                   0x00000002
#define _TRISC_TRISC2_MASK                       0x00000004
#define _TRISC_TRISC2_LENGTH                     0x00000001

#define _TRISC_TRISC6_POSITION                   0x00000006
#define _TRISC_TRISC6_MASK                       0x00000040
#define _TRISC_TRISC6_LENGTH                     0x00000001

#define _TRISC_TRISC7_POSITION                   0x00000007
#define _TRISC_TRISC7_MASK                       0x00000080
#define _TRISC_TRISC7_LENGTH                     0x00000001

#define _TRISC_TRISC8_POSITION                   0x00000008
#define _TRISC_TRISC8_MASK                       0x00000100
#define _TRISC_TRISC8_LENGTH                     0x00000001

#define _TRISC_TRISC9_POSITION                   0x00000009
#define _TRISC_TRISC9_MASK                       0x00000200
#define _TRISC_TRISC9_LENGTH                     0x00000001

#define _TRISC_TRISC10_POSITION                  0x0000000A
#define _TRISC_TRISC10_MASK                      0x00000400
#define _TRISC_TRISC10_LENGTH                    0x00000001

#define _TRISC_TRISC11_POSITION                  0x0000000B
#define _TRISC_TRISC11_MASK                      0x00000800
#define _TRISC_TRISC11_LENGTH                    0x00000001

