Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpe100.h
#define _ADCDSTAT2_ARDY41_POSITION               0x00000009
#define _ADCDSTAT2_ARDY41_MASK                   0x00000200
#define _ADCDSTAT2_ARDY41_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY45_POSITION               0x0000000D
#define _ADCDSTAT2_ARDY45_MASK                   0x00002000
#define _ADCDSTAT2_ARDY45_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY46_POSITION               0x0000000E
#define _ADCDSTAT2_ARDY46_MASK                   0x00004000
#define _ADCDSTAT2_ARDY46_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY47_POSITION               0x0000000F
#define _ADCDSTAT2_ARDY47_MASK                   0x00008000
#define _ADCDSTAT2_ARDY47_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY48_POSITION               0x00000010
#define _ADCDSTAT2_ARDY48_MASK                   0x00010000
#define _ADCDSTAT2_ARDY48_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY49_POSITION               0x00000011
#define _ADCDSTAT2_ARDY49_MASK                   0x00020000
#define _ADCDSTAT2_ARDY49_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY50_POSITION               0x00000012
#define _ADCDSTAT2_ARDY50_MASK                   0x00040000
#define _ADCDSTAT2_ARDY50_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY51_POSITION               0x00000013
#define _ADCDSTAT2_ARDY51_MASK                   0x00080000
#define _ADCDSTAT2_ARDY51_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY52_POSITION               0x00000014
#define _ADCDSTAT2_ARDY52_MASK                   0x00100000
#define _ADCDSTAT2_ARDY52_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY53_POSITION               0x00000015
#define _ADCDSTAT2_ARDY53_MASK                   0x00200000
#define _ADCDSTAT2_ARDY53_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE0_POSITION                0x00000000
#define _ADCCMPEN1_CMPE0_MASK                    0x00000001
#define _ADCCMPEN1_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE1_POSITION                0x00000001
#define _ADCCMPEN1_CMPE1_MASK                    0x00000002
#define _ADCCMPEN1_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE2_POSITION                0x00000002
#define _ADCCMPEN1_CMPE2_MASK                    0x00000004
#define _ADCCMPEN1_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE3_POSITION                0x00000003
#define _ADCCMPEN1_CMPE3_MASK                    0x00000008
#define _ADCCMPEN1_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE4_POSITION                0x00000004
#define _ADCCMPEN1_CMPE4_MASK                    0x00000010
#define _ADCCMPEN1_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE5_POSITION                0x00000005
#define _ADCCMPEN1_CMPE5_MASK                    0x00000020
#define _ADCCMPEN1_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE6_POSITION                0x00000006
#define _ADCCMPEN1_CMPE6_MASK                    0x00000040
#define _ADCCMPEN1_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE7_POSITION                0x00000007
#define _ADCCMPEN1_CMPE7_MASK                    0x00000080
#define _ADCCMPEN1_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE8_POSITION                0x00000008
#define _ADCCMPEN1_CMPE8_MASK                    0x00000100
#define _ADCCMPEN1_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE9_POSITION                0x00000009
#define _ADCCMPEN1_CMPE9_MASK                    0x00000200
#define _ADCCMPEN1_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN1_CMPE10_MASK                   0x00000400
#define _ADCCMPEN1_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN1_CMPE11_MASK                   0x00000800
#define _ADCCMPEN1_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN1_CMPE12_MASK                   0x00001000
#define _ADCCMPEN1_CMPE12_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN1_CMPE13_MASK                   0x00002000
#define _ADCCMPEN1_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN1_CMPE14_MASK                   0x00004000
#define _ADCCMPEN1_CMPE14_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN1_CMPE15_MASK                   0x00008000
#define _ADCCMPEN1_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE16_POSITION               0x00000010
#define _ADCCMPEN1_CMPE16_MASK                   0x00010000
#define _ADCCMPEN1_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE17_POSITION               0x00000011
#define _ADCCMPEN1_CMPE17_MASK                   0x00020000
#define _ADCCMPEN1_CMPE17_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE18_POSITION               0x00000012
#define _ADCCMPEN1_CMPE18_MASK                   0x00040000
#define _ADCCMPEN1_CMPE18_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE19_POSITION               0x00000013
#define _ADCCMPEN1_CMPE19_MASK                   0x00080000
#define _ADCCMPEN1_CMPE19_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE20_POSITION               0x00000014
#define _ADCCMPEN1_CMPE20_MASK                   0x00100000
#define _ADCCMPEN1_CMPE20_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE21_POSITION               0x00000015
#define _ADCCMPEN1_CMPE21_MASK                   0x00200000
#define _ADCCMPEN1_CMPE21_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE22_POSITION               0x00000016
#define _ADCCMPEN1_CMPE22_MASK                   0x00400000
#define _ADCCMPEN1_CMPE22_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE23_POSITION               0x00000017
#define _ADCCMPEN1_CMPE23_MASK                   0x00800000
#define _ADCCMPEN1_CMPE23_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE24_POSITION               0x00000018
#define _ADCCMPEN1_CMPE24_MASK                   0x01000000
#define _ADCCMPEN1_CMPE24_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE25_POSITION               0x00000019
#define _ADCCMPEN1_CMPE25_MASK                   0x02000000
#define _ADCCMPEN1_CMPE25_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE26_POSITION               0x0000001A
#define _ADCCMPEN1_CMPE26_MASK                   0x04000000
#define _ADCCMPEN1_CMPE26_LENGTH                 0x00000001

